# Николай Козик
# Программа создаёт список книг и выводит информацию о каждой в формате

# Выводим начало выполнения
print("start code ...")

# Создаём список словарей с информацией о книгах
books = [
    {"title": "Война и мир", "author": "Лев Толстой", "year": 1869},
    {"title": "Дом, в котором", "author": "Мариам Петросян", "year": 2009},
    {"title": "Мастер и Маргарита", "author": "Михаил Булгаков", "year": 1967},
    {"title": "Анна Каренина", "author": "Лев Толстой", "year": 1877},
    {"title": "Обитаемый остров", "author": "Аркадий и Борис Стругацкие", "year": 1969}
]

# Перебираем книги и выводим информацию
for i, book in enumerate(books, start=1):
    print(f"-------------------- Книга {i} --------------------")
    print(f"Название: {book['title']}, Автор: {book['author']},")
    print(f"-------------------- {book['year']} --------------------\n")

# Выводим завершение выполнения
print("end code ...")
